In [4]:
# Name  | Class
# --------------
# akash | 1 year
# shiva | 2 year
# pawan | 3 year

# pandas dataframe!
# single columns from a pandas
# dataframe a series

# Pandas DataFrame

In [2]:
import pandas as pd
import numpy  as np

In [5]:
data = {"name":["Bill","Tom","Tim","John","Alex","Vanessa","Kate"],      
       "score":[90,80,85,75,95,60,65],      
       "sport":["Wrestling","Football","Skiing","Swimming","Tennis",
               "Karete","Surfing"],      
       "sex":["M","M","M","M","F","F","F"]}

In [6]:
data

{'name': ['Bill', 'Tom', 'Tim', 'John', 'Alex', 'Vanessa', 'Kate'],
 'score': [90, 80, 85, 75, 95, 60, 65],
 'sport': ['Wrestling',
  'Football',
  'Skiing',
  'Swimming',
  'Tennis',
  'Karete',
  'Surfing'],
 'sex': ['M', 'M', 'M', 'M', 'F', 'F', 'F']}

In [7]:
type(data)

dict

In [8]:
df=pd.DataFrame(data)

In [9]:
df

      name  score      sport sex
0     Bill     90  Wrestling   M
1      Tom     80   Football   M
2      Tim     85     Skiing   M
3     John     75   Swimming   M
4     Alex     95     Tennis   F
5  Vanessa     60     Karete   F
6     Kate     65    Surfing   F

In [10]:
type(df)

pandas.core.frame.DataFrame

In [11]:
df.shape
# rows, columns!

(7, 4)

In [12]:
df.dtypes

name     object
score     int64
sport    object
sex      object
dtype: object

In [13]:
df.head()
# by default it'll show me
# first 5 rows

   name  score      sport sex
0  Bill     90  Wrestling   M
1   Tom     80   Football   M
2   Tim     85     Skiing   M
3  John     75   Swimming   M
4  Alex     95     Tennis   F

In [14]:
df.head(2)

   name  score      sport sex
0  Bill     90  Wrestling   M
1   Tom     80   Football   M

In [15]:
df.tail()
# by default it'll show me
# last 5 rows

      name  score     sport sex
2      Tim     85    Skiing   M
3     John     75  Swimming   M
4     Alex     95    Tennis   F
5  Vanessa     60    Karete   F
6     Kate     65   Surfing   F

In [16]:
df.tail(2)

      name  score    sport sex
5  Vanessa     60   Karete   F
6     Kate     65  Surfing   F

In [17]:
df.index

RangeIndex(start=0, stop=7, step=1)

In [18]:
df.columns

Index(['name', 'score', 'sport', 'sex'], dtype='object')

In [19]:
df.head()

   name  score      sport sex
0  Bill     90  Wrestling   M
1   Tom     80   Football   M
2   Tim     85     Skiing   M
3  John     75   Swimming   M
4  Alex     95     Tennis   F

In [20]:
df['name']

0       Bill
1        Tom
2        Tim
3       John
4       Alex
5    Vanessa
6       Kate
Name: name, dtype: object

In [21]:
type(df['name'])

pandas.core.series.Series

In [22]:
df[['name','sport']]

      name      sport
0     Bill  Wrestling
1      Tom   Football
2      Tim     Skiing
3     John   Swimming
4     Alex     Tennis
5  Vanessa     Karete
6     Kate    Surfing

In [23]:
type(df[['name','sport']])

pandas.core.frame.DataFrame

In [24]:
df.head()

   name  score      sport sex
0  Bill     90  Wrestling   M
1   Tom     80   Football   M
2   Tim     85     Skiing   M
3  John     75   Swimming   M
4  Alex     95     Tennis   F

In [25]:
df[

KeyError: 0

In [26]:
df.describe()
# statistics about each numerical col.

           score
count   7.000000
mean   78.571429
std    12.817399
min    60.000000
25%    70.000000
50%    80.000000
75%    87.500000
max    95.000000

In [27]:
df.head()

   name  score      sport sex
0  Bill     90  Wrestling   M
1   Tom     80   Football   M
2   Tim     85     Skiing   M
3  John     75   Swimming   M
4  Alex     95     Tennis   F

In [28]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    7 non-null      object
 1   score   7 non-null      int64
 2   sport   7 non-null      object
 3   sex     7 non-null      object
dtypes: int64(1), object(3)
memory usage: 352.0+ bytes

In [32]:
df

      name  score      sport sex
0     Bill     90  Wrestling   M
1      Tom     80   Football   M
2      Tim     85     Skiing   M
3     John     75   Swimming   M
4     Alex     95     Tennis   F
5  Vanessa     60     Karete   F
6     Kate     65    Surfing   F

In [35]:
df['sex'].value_counts()

sex
M    4
F    3
Name: count, dtype: int64

In [36]:
df['sex'].unique()

array(['M', 'F'], dtype=object)

In [37]:
df['sex'].nunique()
# no. of unique values

2

In [38]:
df.head()

   name  score      sport sex
0  Bill     90  Wrestling   M
1   Tom     80   Football   M
2   Tim     85     Skiing   M
3  John     75   Swimming   M
4  Alex     95     Tennis   F

In [39]:
df['new'] = df['score']/10

In [40]:
df

      name  score      sport sex  new
0     Bill     90  Wrestling   M  9.0
1      Tom     80   Football   M  8.0
2      Tim     85     Skiing   M  8.5
3     John     75   Swimming   M  7.5
4     Alex     95     Tennis   F  9.5
5  Vanessa     60     Karete   F  6.0
6     Kate     65    Surfing   F  6.5

In [ ]:
Is the result of value_count a df itself?

In [42]:
type(df['sex'].value_counts())

pandas.core.series.Series

In [44]:
df['new2'] = df['score']/df['new']

In [45]:
df

      name  score      sport sex  new  new2
0     Bill     90  Wrestling   M  9.0  10.0
1      Tom     80   Football   M  8.0  10.0
2      Tim     85     Skiing   M  8.5  10.0
3     John     75   Swimming   M  7.5  10.0
4     Alex     95     Tennis   F  9.5  10.0
5  Vanessa     60     Karete   F  6.0  10.0
6     Kate     65    Surfing   F  6.5  10.0

In [48]:
df['score']

0    90
1    80
2    85
3    75
4    95
5    60
6    65
Name: score, dtype: int64

In [49]:
df[df['score'] > 89]

   name  score      sport sex  new  new2
0  Bill     90  Wrestling   M  9.0  10.0
4  Alex     95     Tennis   F  9.5  10.0

In [50]:
df

      name  score      sport sex  new  new2
0     Bill     90  Wrestling   M  9.0  10.0
1      Tom     80   Football   M  8.0  10.0
2      Tim     85     Skiing   M  8.5  10.0
3     John     75   Swimming   M  7.5  10.0
4     Alex     95     Tennis   F  9.5  10.0
5  Vanessa     60     Karete   F  6.0  10.0
6     Kate     65    Surfing   F  6.5  10.0

In [55]:
df.sort_values(by = 'score')
# df.sort_values(by = [['score','..','..']])

      name  score      sport sex  new  new2
5  Vanessa     60     Karete   F  6.0  10.0
6     Kate     65    Surfing   F  6.5  10.0
3     John     75   Swimming   M  7.5  10.0
1      Tom     80   Football   M  8.0  10.0
2      Tim     85     Skiing   M  8.5  10.0
0     Bill     90  Wrestling   M  9.0  10.0
4     Alex     95     Tennis   F  9.5  10.0

In [57]:
x = df.sort_values(by = 'score',ascending = False)

In [58]:
x

      name  score      sport sex  new  new2
4     Alex     95     Tennis   F  9.5  10.0
0     Bill     90  Wrestling   M  9.0  10.0
2      Tim     85     Skiing   M  8.5  10.0
1      Tom     80   Football   M  8.0  10.0
3     John     75   Swimming   M  7.5  10.0
6     Kate     65    Surfing   F  6.5  10.0
5  Vanessa     60     Karete   F  6.0  10.0

In [59]:
x.reset_index(drop=True)

      name  score      sport sex  new  new2
0     Alex     95     Tennis   F  9.5  10.0
1     Bill     90  Wrestling   M  9.0  10.0
2      Tim     85     Skiing   M  8.5  10.0
3      Tom     80   Football   M  8.0  10.0
4     John     75   Swimming   M  7.5  10.0
5     Kate     65    Surfing   F  6.5  10.0
6  Vanessa     60     Karete   F  6.0  10.0

In [56]:
df

      name  score      sport sex  new  new2
0     Bill     90  Wrestling   M  9.0  10.0
1      Tom     80   Football   M  8.0  10.0
2      Tim     85     Skiing   M  8.5  10.0
3     John     75   Swimming   M  7.5  10.0
4     Alex     95     Tennis   F  9.5  10.0
5  Vanessa     60     Karete   F  6.0  10.0
6     Kate     65    Surfing   F  6.5  10.0

In [60]:
def div(x):
    return x/10

In [63]:
df['new3'] = df['new2'].apply(div)

In [64]:
df

      name  score      sport sex  new  new2  new3
0     Bill     90  Wrestling   M  9.0  10.0   1.0
1      Tom     80   Football   M  8.0  10.0   1.0
2      Tim     85     Skiing   M  8.5  10.0   1.0
3     John     75   Swimming   M  7.5  10.0   1.0
4     Alex     95     Tennis   F  9.5  10.0   1.0
5  Vanessa     60     Karete   F  6.0  10.0   1.0
6     Kate     65    Surfing   F  6.5  10.0   1.0

In [65]:
# map -->
# func, list/tuple